# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Linux з попередньо встановленим python-3.10
FROM python:3.11-slim

# Встановимо змінну середовища
ENV APP_HOME /app

# Встановимо робочу директорію всередині контейнера
WORKDIR $APP_HOME

# Скопіюємо інші файли в робочу директорію контейнера
COPY requirements.txt .

# Встановимо залежності всередині контейнера
RUN pip install -r requirements.txt

COPY . .

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 8080

# Запустимо наш застосунок всередині контейнера
ENTRYPOINT ["python", "server.py"]
